app/controllers/cobarails_controller.rb

SELECT `cobarails`.* FROM `cobarails`
---
  def index
    @cobarails = Cobarail.all

INSERT INTO `cobarails` (`first_name`, `last_name`, `email`, `phone`, `twitter`, `created_at`, `updated_at`) VALUES ('Dadang', 'Jebreds', 'dadang.jebreds@gmail.com', '0821214312', '@dadangs', '2021-10-04 13:16:10.463322', '2021-10-04 13:16:10.463322')
---
  def create
    @cobarail = Cobarail.new(cobarail_params)

    respond_to do |format|
      if @cobarail.save

UPDATE `cobarails` SET `cobarails`.`last_name` = 'Supradi', `cobarails`.`updated_at` = '2021-10-04 13:36:05.181090' WHERE `cobarails`.`id` = 2
---
  def update
    respond_to do |format|
      if @cobarail.update(cobarail_params)

DELETE FROM `cobarails` WHERE `cobarails`.`id` = 4
---
  def destroy
    @cobarail.destroy

SELECT `cobarails`.* FROM `cobarails` WHERE `cobarails`.`id` = 1 LIMIT 1
---
    def set_cobarail
      @cobarail = Cobarail.find(params[:id])